### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [1]:
import pandas as pd
import numpy as np

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [4]:
my_lst = list('abcdefghijklmnopqrstuvwxyz')

In [6]:
my_arr = np.arange(26)

In [7]:
my_arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25])

In [9]:
#my_lst

In [76]:
my_dict = dict(zip(my_lst, my_arr))

In [77]:
my_dict

{'a': 0,
 'b': 1,
 'c': 2,
 'd': 3,
 'e': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9,
 'k': 10,
 'l': 11,
 'm': 12,
 'n': 13,
 'o': 14,
 'p': 15,
 'q': 16,
 'r': 17,
 's': 18,
 't': 19,
 'u': 20,
 'v': 21,
 'w': 22,
 'x': 23,
 'y': 24,
 'z': 25}

In [23]:
df = pd.DataFrame.from_dict(my_dict, orient='index').reset_index()

In [24]:
df.head()

  index  0
0     a  0
1     b  1
2     c  2
3     d  3
4     e  4

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [29]:
ser = pd.Series(np.take(list('abcdefgh'),np.random.randint(8, size = 30)))

In [30]:
ser

0     c
1     c
2     e
3     e
4     f
5     a
6     e
7     g
8     a
9     b
10    h
11    b
12    c
13    g
14    h
15    a
16    c
17    b
18    c
19    c
20    e
21    h
22    h
23    f
24    c
25    f
26    e
27    h
28    c
29    a
dtype: object

In [3]:
## your output should look like this.

f    7
c    5
g    4
b    4
h    4
e    3
a    3
dtype: int64

In [32]:
d = {}
for i in ser:
    if i not in d:
        d[i]= 1
    else:
        d[i]+=1

In [33]:
d

{'c': 8, 'e': 5, 'f': 3, 'a': 4, 'g': 2, 'b': 3, 'h': 5}

In [35]:
#ser

In [36]:
ser.value_counts()

c    8
e    5
h    5
a    4
f    3
b    3
g    2
dtype: int64

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [ ]:
# just write that parameter name here

In [39]:
#usecols

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [87]:
# read fruits.csv file
df = pd.read_csv('fruits.csv')

### Q4. Get mean, median, max , min price for each fruit .

In [9]:
# Your output should look like this

   Fruit Name        mean  median  max
0      Banana   98.500000    98.5  112
1       Mango  106.666667   100.0  160
2   PineApple  187.500000   187.5  285
3  Strawberry  200.000000   200.0  200

In [50]:
ojb = df.groupby('Fruit Name')

In [53]:
ojb.aggregate(['mean', 'median', 'max'])['Price'].reset_index()

   Fruit Name        mean  median  max
0      Banana   98.500000    98.5  112
1       Mango  106.666667   100.0  160
2   PineApple  187.500000   187.5  285
3  Strawberry  200.000000   200.0  200

### Q5. What is the total cost of this basket?

In [10]:
#your output should be this

1092

In [56]:
df['Price'].sum()

1092

### Q6. Which fruit has the maximum price per quantity?

In [13]:
# your output should be

'PineApple'

In [57]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [60]:
df['price/quantity'] = df['Price']/df['Quantity']

In [61]:
df

   Fruit Name  Quantity  Price  price/quantity
0      Banana        78    112        1.435897
1       Mango        40    160        4.000000
2      Banana        20     85        4.250000
3   PineApple        15     90        6.000000
4  Strawberry       100    200        2.000000
5       Mango        25     60        2.400000
6       Mango        40    100        2.500000
7   PineApple        50    285        5.700000

In [65]:
df.sort_values('price/quantity', ascending=False).iloc[0]['Fruit Name']

'PineApple'

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [18]:
#your output should be like this and should have 20 records in total

   0  1  2  3  4  5  6
0  1  0  0  0  0  0  0
1  0  1  0  0  0  0  0
2  1  0  0  0  0  0  0
3  0  1  0  0  0  0  0
4  1  0  0  0  0  0  0

In [66]:
arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]

In [67]:
pd.get_dummies(arr)

    0  1  2  3  4  5  6
0   1  0  0  0  0  0  0
1   0  1  0  0  0  0  0
2   1  0  0  0  0  0  0
3   0  1  0  0  0  0  0
4   1  0  0  0  0  0  0
5   0  0  1  0  0  0  0
6   0  0  0  1  0  0  0
7   0  0  0  0  0  0  1
8   0  0  0  0  0  1  0
9   1  0  0  0  0  0  0
10  1  0  0  0  0  0  0
11  1  0  0  0  0  0  0
12  0  0  0  0  1  0  0
13  0  1  0  0  0  0  0
14  0  0  1  0  0  0  0
15  0  0  0  1  0  0  0
16  0  0  0  0  0  1  0
17  0  0  0  0  0  1  0
18  0  0  0  0  1  0  0
19  0  0  0  0  1  0  0

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [22]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [69]:
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

In [78]:
data = pd.DataFrame(dict_)

#### b. Write code to get the number of missing values for each column.

In [23]:
#your output should be like this

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [79]:
data.isna().sum()

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [27]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

In [82]:
data['First Score'].mean()

95.0

In [85]:
data['First Score'].fillna(value=data['First Score'].mean(), inplace=True)
data['Second Score'].fillna(value=data['Second Score'].mean(), inplace=True)
data['Third Score'].fillna(value=data['Third Score'].mean(), inplace=True)

In [86]:
data

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [28]:
#your output should be like this

   index  Fruit Name  Quantity  Price  price/quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

In [88]:
df

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [92]:
df.reset_index()

   index  Fruit Name  Quantity  Price
0      0      Banana        78    112
1      1       Mango        40    160
2      2      Banana        20     85
3      3   PineApple        15     90
4      4  Strawberry       100    200
5      5       Mango        25     60
6      6       Mango        40    100
7      7   PineApple        50    285

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [30]:
#your output should be like this

  Location Population  ...  No. of shops Weekly market day
0      ABB   2.5 lakh  ...           150   Nothing as such
1      ABC   1.5 lakh  ...           120           Tuesday
2      CDD   3.5 lakh  ...           180         Wednesday

[3 rows x 6 columns]

In [94]:
s1 = pd.read_csv('sample_sheet_1.csv')

In [96]:
s2 = pd.read_csv('sample_sheet_2.csv')

In [104]:
s1.merge(s2, how='left', on='Location')

,Location,Population,House_count,Location Area,No. of shops,Weekly market day
0,ABB,2.5 lakh,763,25 hectare,150,Nothing as such
1,ABC,1.5 lakh,520,20 hectare,120,Tuesday
2,CDD,3.5 lakh,800,35 hectare,180,Wednesday